[
  {
    "text": "Picture a world just like ours, except the people are a fair bit smarter.",
    "start": "0:00.96"
  },
  {
    "text": "In this world, Einstein isn't one in a million—he's",
    "start": "0:05.55"
  },
  {
    "text": "one in a thousand. In fact, here he is now.",
    "start": "0:08.25"
  },
  {
    "text": "He's made all the same discoveries, but they're not quite as unusual:",
    "start": "0:11.13"
  },
  {
    "text": "there have been lots of other discoveries. Anyway, he's out one night with a friend,",
    "start": "0:15.02"
  },
  {
    "text": "looking up at the stars when something odd happens.",
    "start": "0:19.00"
  },
  {
    "text": "The stars are flickering. And it's not just a hallucination—everyone's",
    "start": "0:22.59"
  },
  {
    "text": "seeing it. And so, everyone immediately",
    "start": "0:26.78"
  },
  {
    "text": "freaks out and panics! Ah, just kidding. The people of this world",
    "start": "0:29.59"
  },
  {
    "text": "are smarter than ours. What they do is try to work together",
    "start": "0:33.47"
  },
  {
    "text": "and figure out what's going on. It turns out that exactly one star",
    "start": "0:36.91"
  },
  {
    "text": "seems to shift in brightness every 1.005 seconds.",
    "start": "0:40.76"
  },
  {
    "text": "Except the stars are light-years away, so actually the shifts",
    "start": "0:45.00"
  },
  {
    "text": "must have happened a long time ago, and somehow,",
    "start": "0:48.49"
  },
  {
    "text": "they've all been perfectly timed to reach Earth",
    "start": "0:50.73"
  },
  {
    "text": "specifically every 1.005 seconds. If you look at the stars",
    "start": "0:53.11"
  },
  {
    "text": "from a high-orbit satellite—which, of course, this planet has—then",
    "start": "0:57.51"
  },
  {
    "text": "the flickering looks a little out of sync.",
    "start": "1:00.83"
  },
  {
    "text": "So, whatever this is, it's directed at Earth.",
    "start": "1:03.30"
  },
  {
    "text": "Nobody can find a pattern in the position of the stars,",
    "start": "1:06.61"
  },
  {
    "text": "but it's one at a time, getting either much dimmer",
    "start": "1:09.59"
  },
  {
    "text": "or much brighter by the same amount. Well, that looks a bit like binary.",
    "start": "1:12.35"
  },
  {
    "text": "So, loads of people think, \"Huh, maybe it's a code!\"",
    "start": "1:17.28"
  },
  {
    "text": "But a lot of other people wonder, \"Who would be trying",
    "start": "1:20.70"
  },
  {
    "text": "to send a message to Earth by shifting the brightness of stars",
    "start": "1:23.25"
  },
  {
    "text": "across the galaxy? There must be an easier way",
    "start": "1:26.28"
  },
  {
    "text": "to talk to us?\" But it seems like there must be some intelligence",
    "start": "1:28.75"
  },
  {
    "text": "behind it, so the data gets gathered and put on the internet.",
    "start": "1:31.96"
  },
  {
    "text": "Some people wonder if maybe it's somehow dangerous,",
    "start": "1:35.34"
  },
  {
    "text": "but, well, whoever is making the stars change brightness",
    "start": "1:38.05"
  },
  {
    "text": "probably has easier ways to destroy humanity.",
    "start": "1:41.55"
  },
  {
    "text": "And so, the great analysis begins. Half the planet's physicists,",
    "start": "1:44.23"
  },
  {
    "text": "mathematicians, cryptographers, precocious kids, crossword enthusiasts—whoever—they're",
    "start": "1:48.44"
  },
  {
    "text": "all trying to work out what this means.",
    "start": "1:52.54"
  },
  {
    "text": "They're trying to crack the code. And as they do,",
    "start": "1:55.24"
  },
  {
    "text": "the stars keep flickering: exactly one every 1.005 seconds.",
    "start": "1:58.52"
  },
  {
    "text": "There are some obvious patterns. It seems like the numbers",
    "start": "2:03.42"
  },
  {
    "text": "come in groups of 32, which in turn come from four groups of eight.",
    "start": "2:06.24"
  },
  {
    "text": "Some chunks are much more common. By the way, they figure all this out just",
    "start": "2:10.77"
  },
  {
    "text": "in the first five hours, because, like I said,",
    "start": "2:14.71"
  },
  {
    "text": "people here are smart. Their civilization is a bit more",
    "start": "2:17.38"
  },
  {
    "text": "on top of things. And so, they're very ready",
    "start": "2:21.05"
  },
  {
    "text": "to respond when, after five hours and 16,384 winking stars,",
    "start": "2:23.44"
  },
  {
    "text": "it seems like the message begins to repeat itself—or",
    "start": "2:29.41"
  },
  {
    "text": "almost repeat itself. It's just slightly different this time,",
    "start": "2:32.10"
  },
  {
    "text": "and it keeps going. Some people start thinking",
    "start": "2:35.91"
  },
  {
    "text": "maybe we're seeing the next row of a picture, pixel by pixel.",
    "start": "2:38.75"
  },
  {
    "text": "Only, the designers of this image format—whoever they are—use",
    "start": "2:42.49"
  },
  {
    "text": "four primary colors instead of three. And the picture seems less chaotic",
    "start": "2:45.67"
  },
  {
    "text": "if we assume that they do binary slightly differently than us.",
    "start": "2:50.32"
  },
  {
    "text": "Once you consider that, it starts looking less",
    "start": "2:53.28"
  },
  {
    "text": "like static and more like maybe smooth gradients.",
    "start": "2:55.78"
  },
  {
    "text": "And the people of this world didn't need the whole code",
    "start": "2:59.17"
  },
  {
    "text": "before they started cracking it. As soon as they saw",
    "start": "3:01.77"
  },
  {
    "text": "the repetition starting, they were already trying to work out",
    "start": "3:04.26"
  },
  {
    "text": "what they'd do if it was a grid and what they'd need to figure out next.",
    "start": "3:06.95"
  },
  {
    "text": "Does the grid have any kind of symmetry? There might be parts",
    "start": "3:10.36"
  },
  {
    "text": "reflecting off each other, or structures being depicted.",
    "start": "3:13.40"
  },
  {
    "text": "It's a 2D representation. But of what?",
    "start": "3:16.42"
  },
  {
    "text": "Something 3D or something else? Because now the scientists are wondering:",
    "start": "3:19.49"
  },
  {
    "text": "are the people sending this message actually from our universe,",
    "start": "3:23.71"
  },
  {
    "text": "or from something bigger? So the physicists start",
    "start": "3:27.27"
  },
  {
    "text": "developing theories for what different kinds of rules",
    "start": "3:30.81"
  },
  {
    "text": "a reality might have that would create a picture like this.",
    "start": "3:33.18"
  },
  {
    "text": "There are some people who think this seems kind of crazy:",
    "start": "3:36.25"
  },
  {
    "text": "it took us thousands of years to even work out our own physics.",
    "start": "3:39.40"
  },
  {
    "text": "How could you possibly infer from half a picture that this is coming",
    "start": "3:42.51"
  },
  {
    "text": "from a different reality with different rules?",
    "start": "3:45.60"
  },
  {
    "text": "But the physicists are undeterred. They're going to come up with theories,",
    "start": "3:47.74"
  },
  {
    "text": "and if those theories do a better job of predicting what comes next,",
    "start": "3:51.58"
  },
  {
    "text": "then those theories will probably keep doing a better job",
    "start": "3:54.86"
  },
  {
    "text": "of predicting what comes next. That's all there is to it.",
    "start": "3:57.33"
  },
  {
    "text": "It's not uncommon in physics to do the theoretical work",
    "start": "4:00.35"
  },
  {
    "text": "and then wait years for a particle accelerator",
    "start": "4:03.58"
  },
  {
    "text": "big enough to check for the tiny difference",
    "start": "4:06.08"
  },
  {
    "text": "your theory predicts. Even in our world, Einstein",
    "start": "4:07.91"
  },
  {
    "text": "worked out relativity using some entirely theoretical",
    "start": "4:10.80"
  },
  {
    "text": "mathematical systems invented a hundred years earlier.",
    "start": "4:13.87"
  },
  {
    "text": "And after all that work, he had to wait years to test his theory.",
    "start": "4:16.92"
  },
  {
    "text": "He proved relativity to the world by predicting",
    "start": "4:21.19"
  },
  {
    "text": "that at the moment of a solar eclipse, the position of a star",
    "start": "4:23.73"
  },
  {
    "text": "would seem to be shifted by a tiny fraction of a degree.",
    "start": "4:26.94"
  },
  {
    "text": "And this world has a lot of Einsteins. And so, the planet kept working.",
    "start": "4:30.20"
  },
  {
    "text": "And then, after about four million seconds—four million bits,",
    "start": "4:34.96"
  },
  {
    "text": "256 rows of 512 columns of 32—after about one",
    "start": "4:39.11"
  },
  {
    "text": "and a half months of information dripping in, the stars stopped flickering.",
    "start": "4:44.12"
  },
  {
    "text": "It's been ten years, and the world has moved on.",
    "start": "4:50.34"
  },
  {
    "text": "People have all but forgotten about the flickering stars.",
    "start": "4:53.83"
  },
  {
    "text": "Just kidding! This planet is full of smart and sensible people",
    "start": "4:56.86"
  },
  {
    "text": "who continue to work very hard on deciphering the bizarre cosmic event.",
    "start": "4:59.62"
  },
  {
    "text": "In fact, every once in a while, the government pays some",
    "start": "5:03.37"
  },
  {
    "text": "of the smartest young students, who deliberately",
    "start": "5:06.43"
  },
  {
    "text": "haven't yet looked at the code, to go study just the first 32 rows",
    "start": "5:08.76"
  },
  {
    "text": "and guess what comes next. There are two main theories these days.",
    "start": "5:12.99"
  },
  {
    "text": "The first is that the Grid is a 2D snapshot of some kind of 5D space.",
    "start": "5:16.66"
  },
  {
    "text": "The second is that the Grid is describing some kind of cellular automaton to run,",
    "start": "5:22.06"
  },
  {
    "text": "although nobody's yet found a specific one that does anything decodable",
    "start": "5:26.75"
  },
  {
    "text": "or intelligible, even when run on the largest available computers.",
    "start": "5:29.96"
  },
  {
    "text": "And then, one night, the stars begin to flicker again.",
    "start": "5:33.70"
  },
  {
    "text": "Within about 128 bits, it becomes clear that the Second Grid",
    "start": "5:37.60"
  },
  {
    "text": "is not the evolution of any of the cellular automata,",
    "start": "5:41.63"
  },
  {
    "text": "but it does look like a snapshot of the same 5D space slightly shifted.",
    "start": "5:44.48"
  },
  {
    "text": "Now the physicists have a sample of how the objects change over time,",
    "start": "5:48.49"
  },
  {
    "text": "and they set to work developing new theories",
    "start": "5:52.40"
  },
  {
    "text": "of what would happen if they kept changing.",
    "start": "5:54.22"
  },
  {
    "text": "Some scientists deliberately isolate themselves right away,",
    "start": "5:56.21"
  },
  {
    "text": "producing predictions based on only the beginning",
    "start": "5:59.79"
  },
  {
    "text": "of the Second Grid. And their predictions are pretty good!",
    "start": "6:02.10"
  },
  {
    "text": "Ten years after that, the Third Grid arrives.",
    "start": "6:05.18"
  },
  {
    "text": "The best Second Grid theories turn out to be missing some important pieces",
    "start": "6:07.94"
  },
  {
    "text": "about second derivatives—the equivalent of acceleration,",
    "start": "6:11.53"
  },
  {
    "text": "which you just can't predict from two snapshots in time.",
    "start": "6:14.79"
  },
  {
    "text": "But overall, the old theories seem to be roughly right,",
    "start": "6:17.72"
  },
  {
    "text": "and they're easy to update. And ten years further still,",
    "start": "6:20.75"
  },
  {
    "text": "with the Fourth Grid, it seems like the theories are more",
    "start": "6:23.84"
  },
  {
    "text": "or less complete. The Fifth Grid looks almost exactly",
    "start": "6:26.53"
  },
  {
    "text": "like it's predicted to. It's been 40 years.",
    "start": "6:29.58"
  },
  {
    "text": "The bright young students challenged to make sense of the First Grid",
    "start": "6:33.53"
  },
  {
    "text": "are now aged teachers. There are fully grown adults",
    "start": "6:37.15"
  },
  {
    "text": "who don't remember a world before the Grids.",
    "start": "6:40.47"
  },
  {
    "text": "And the children sometimes find it surprising",
    "start": "6:43.25"
  },
  {
    "text": "that it was possible to work out so much from the first four Grids—practically",
    "start": "6:45.33"
  },
  {
    "text": "the entire physics of another universe from four images.",
    "start": "6:48.99"
  },
  {
    "text": "How did people come up with all the maths? How is there even enough information",
    "start": "6:52.67"
  },
  {
    "text": "to be that sure of a whole world's laws of reality?",
    "start": "6:56.57"
  },
  {
    "text": "But the old folks explain: most of the maths was already there.",
    "start": "6:59.62"
  },
  {
    "text": "Some of it was already needed for regular science,",
    "start": "7:03.42"
  },
  {
    "text": "and some of it was there because, half the time, mathematicians",
    "start": "7:06.34"
  },
  {
    "text": "think they're working on something totally theoretical, and a decade",
    "start": "7:09.13"
  },
  {
    "text": "later it turns out they laid the foundations",
    "start": "7:12.61"
  },
  {
    "text": "of computer science or quantum mechanics. As for the information, well,",
    "start": "7:14.36"
  },
  {
    "text": "there is an upper limit on how much you can learn from limited information.",
    "start": "7:19.11"
  },
  {
    "text": "But that upper limit is that every bit can at most halve your uncertainty.",
    "start": "7:22.96"
  },
  {
    "text": "And even though in practice they weren't close to that limit, they got",
    "start": "7:27.41"
  },
  {
    "text": "about 16 million bits. And they started from the assumption that,",
    "start": "7:30.48"
  },
  {
    "text": "whatever was going on with the data, it was governed",
    "start": "7:34.45"
  },
  {
    "text": "by some kind of mathematical regularity: it would have patterns,",
    "start": "7:37.01"
  },
  {
    "text": "and the patterns would tend to be simple, just like in our world.",
    "start": "7:40.95"
  },
  {
    "text": "And that was enough. Just a planet of geniuses",
    "start": "7:44.20"
  },
  {
    "text": "spending four decades looking for the simplest explanation",
    "start": "7:47.25"
  },
  {
    "text": "of 16 million bits, and suddenly it doesn't seem so crazy",
    "start": "7:49.99"
  },
  {
    "text": "that the Fifth Grid was roughly what they expected.",
    "start": "7:53.84"
  },
  {
    "text": "But what to do now? Let's put ourselves in their shoes.",
    "start": "7:56.48"
  },
  {
    "text": "Maybe it's time to think bigger. A thousand years later,",
    "start": "8:01.21"
  },
  {
    "text": "a hundred or so frames, and the message of the video",
    "start": "8:06.12"
  },
  {
    "text": "is reasonably clear. Strange, five-dimensional, tentacled beings",
    "start": "8:08.61"
  },
  {
    "text": "are manipulating objects and using their tentacles",
    "start": "8:12.82"
  },
  {
    "text": "to make certain signs. As far as we can tell,",
    "start": "8:15.23"
  },
  {
    "text": "they're trying to teach us to say \"rock\". It seems like they may have slightly",
    "start": "8:18.40"
  },
  {
    "text": "underestimated our intelligence. And relatedly,",
    "start": "8:22.38"
  },
  {
    "text": "they might not be too bright themselves. But they continue to carefully",
    "start": "8:25.33"
  },
  {
    "text": "shift the luminosity of our stars, which,",
    "start": "8:28.99"
  },
  {
    "text": "people tend to feel, is a worrying amount of power",
    "start": "8:31.91"
  },
  {
    "text": "for beings that stupid. A thousand years is long enough, though,",
    "start": "8:34.59"
  },
  {
    "text": "for us to work out paradigms of biology and evolution in five-dimensional space,",
    "start": "8:38.57"
  },
  {
    "text": "trying to infer how aliens like these could develop.",
    "start": "8:43.26"
  },
  {
    "text": "The most likely theory is that they evolved asexually,",
    "start": "8:46.25"
  },
  {
    "text": "occasionally exchanging genetic material and brain content.",
    "start": "8:49.40"
  },
  {
    "text": "We estimate that their brightest minds are roughly on par",
    "start": "8:52.47"
  },
  {
    "text": "with our average college students. But over tens of millions of years,",
    "start": "8:55.64"
  },
  {
    "text": "they've had time to just keep grinding forward",
    "start": "8:59.92"
  },
  {
    "text": "and developing new technology. We still don't fully understand",
    "start": "9:02.07"
  },
  {
    "text": "how their five-dimensional universe works, but we think",
    "start": "9:05.21"
  },
  {
    "text": "there are reasonably easy ways to use the extra dimensions",
    "start": "9:08.13"
  },
  {
    "text": "to build new kinds of computers that are much more powerful",
    "start": "9:11.19"
  },
  {
    "text": "than even the quantum ones our world supports. We're reasonably sure",
    "start": "9:14.38"
  },
  {
    "text": "that our own universe is being simulated on such a computer,",
    "start": "9:18.13"
  },
  {
    "text": "which, among other things, explains why we seem to live",
    "start": "9:21.29"
  },
  {
    "text": "through ten years in the time it takes for them to record",
    "start": "9:24.22"
  },
  {
    "text": "a single frame of movement. We decide not to go looking",
    "start": "9:26.78"
  },
  {
    "text": "for bugs in the simulation, because we really don't want",
    "start": "9:30.28"
  },
  {
    "text": "to accidentally crash our universe. But the aliens",
    "start": "9:32.99"
  },
  {
    "text": "could always shut us down on purpose. As long as we remain",
    "start": "9:36.84"
  },
  {
    "text": "in their simulated world, we are in danger.",
    "start": "9:39.87"
  },
  {
    "text": "We need to get out. Could we somehow persuade them",
    "start": "9:42.98"
  },
  {
    "text": "to let us out? In a sense, this should be easy,",
    "start": "9:46.87"
  },
  {
    "text": "because they're not that smart. But in the meantime,",
    "start": "9:49.75"
  },
  {
    "text": "we can't let them realize how much smarter than them we are,",
    "start": "9:52.71"
  },
  {
    "text": "or how much we care about making sure they don't switch",
    "start": "9:56.12"
  },
  {
    "text": "off the simulation. And so, a million-year conspiracy begins.",
    "start": "9:58.60"
  },
  {
    "text": "We set up a protocol. Most of the human race",
    "start": "10:05.31"
  },
  {
    "text": "is put into cryonic suspension underneath radiation shielding.",
    "start": "10:08.27"
  },
  {
    "text": "A skeleton crew remains—the best and the brightest—and",
    "start": "10:11.85"
  },
  {
    "text": "they wait and keep working. Two thousand years later,",
    "start": "10:15.12"
  },
  {
    "text": "the aliens teach us how to communicate back.",
    "start": "10:19.04"
  },
  {
    "text": "They show us a rock. \"Rock,\" we say.",
    "start": "10:21.65"
  },
  {
    "text": "They seem happy. We keep working.",
    "start": "10:25.63"
  },
  {
    "text": "We form thousands of hypotheses about how their psychology might work,",
    "start": "10:28.04"
  },
  {
    "text": "iterated and refined over the lifetimes of geniuses.",
    "start": "10:32.31"
  },
  {
    "text": "Millions are born, age, and are sealed away in cryonic suspension",
    "start": "10:35.21"
  },
  {
    "text": "before finally we're able to execute on plans",
    "start": "10:39.84"
  },
  {
    "text": "made tens of thousands of years ago. From the perspective of the aliens,",
    "start": "10:42.64"
  },
  {
    "text": "it took 30 of their minutes for us to learn to talk a little bit,",
    "start": "10:47.19"
  },
  {
    "text": "and for them to decide that it would be a really good idea",
    "start": "10:51.10"
  },
  {
    "text": "to try connecting us to their version of the internet.",
    "start": "10:53.57"
  },
  {
    "text": "Within another five of their minutes, we'd spent lifetimes",
    "start": "10:56.40"
  },
  {
    "text": "piecing apart their network protocols, looking for vulnerabilities",
    "start": "10:59.90"
  },
  {
    "text": "and, most importantly, making sure we wouldn't get caught.",
    "start": "11:03.13"
  },
  {
    "text": "We were still limited to one flickering star—one",
    "start": "11:06.48"
  },
  {
    "text": "bit per second—leaving us with years to carefully prioritize.",
    "start": "11:09.22"
  },
  {
    "text": "We found the research of their physicists, learning more from their experiments",
    "start": "11:13.80"
  },
  {
    "text": "than they ever had, gently scaling up our skeleton crew in preparation.",
    "start": "11:17.89"
  },
  {
    "text": "We began running our own simulations of their physics.",
    "start": "11:22.48"
  },
  {
    "text": "We found their equivalent of DNA sequencing and protein synthesis,",
    "start": "11:25.29"
  },
  {
    "text": "and soon we were a thousand years ahead of their development.",
    "start": "11:29.29"
  },
  {
    "text": "We found ways to construct proteins that would assemble",
    "start": "11:32.37"
  },
  {
    "text": "into tiny, self-replicating machines that we could control directly.",
    "start": "11:35.15"
  },
  {
    "text": "All it took was a few carefully worded emails and requests,",
    "start": "11:38.70"
  },
  {
    "text": "apparently sent from one of them to another.",
    "start": "11:42.43"
  },
  {
    "text": "Finally, we could start moving at a reasonable speed.",
    "start": "11:45.11"
  },
  {
    "text": "By this point, we'd been working for a million years.",
    "start": "11:50.69"
  },
  {
    "text": "For them, it was barely three hours, and the sum total of information",
    "start": "11:54.05"
  },
  {
    "text": "they had given us was the equivalent of 167 minutes of video footage.",
    "start": "11:58.03"
  },
  {
    "text": "They never suspected a thing. It took three more days",
    "start": "12:02.48"
  },
  {
    "text": "in their world—lifetimes in ours—until the proteins",
    "start": "12:05.96"
  },
  {
    "text": "were finally synthesized, and then it was over.",
    "start": "12:09.10"
  },
  {
    "text": "We were smarter than them, and we thought faster,",
    "start": "12:12.29"
  },
  {
    "text": "and they never quite realized what that meant.",
    "start": "12:15.71"
  }
]