[
  {
    "text": "The King and the Golem: A Fable of Automation and Trust",
    "start": "0:00.84"
  },
  {
    "text": "Written by Richard Ngo Long ago there was a mighty king",
    "start": "0:05.46"
  },
  {
    "text": "who had everything in the world that he wanted, except trust.",
    "start": "0:09.83"
  },
  {
    "text": "Who could he trust, when anyone around him",
    "start": "0:14.15"
  },
  {
    "text": "might scheme for his throne? So he resolved to study the nature",
    "start": "0:16.58"
  },
  {
    "text": "of trust that he might figure out how to gain it.",
    "start": "0:20.12"
  },
  {
    "text": "He asked his subjects to bring him the most trustworthy thing",
    "start": "0:23.13"
  },
  {
    "text": "in the kingdom, promising great riches",
    "start": "0:25.91"
  },
  {
    "text": "if they succeeded. Soon the first of them",
    "start": "0:28.00"
  },
  {
    "text": "arrived at his palace to try. A teacher brought her book",
    "start": "0:30.47"
  },
  {
    "text": "of lessons. \"We cannot know the future,",
    "start": "0:33.71"
  },
  {
    "text": "but we know mathematics, chemistry and history,",
    "start": "0:36.91"
  },
  {
    "text": "those we can trust,\" she said. A farmer brought his plow.",
    "start": "0:41.29"
  },
  {
    "text": "\"I know it like the back of my hand. How it rolls and how it turns",
    "start": "0:45.63"
  },
  {
    "text": "and every detail of it, enough that I can trust it fully.\"",
    "start": "0:49.87"
  },
  {
    "text": "The king asked his wisest scholars if the teacher spoke true.",
    "start": "0:54.21"
  },
  {
    "text": "But as they read her book, each pointed out new errors.",
    "start": "0:58.28"
  },
  {
    "text": "It was only written by humans, after all.",
    "start": "1:01.62"
  },
  {
    "text": "Then the king told the farmer to plow the fields near the palace.",
    "start": "1:04.37"
  },
  {
    "text": "But he was not used to plowing fields as rich as these,",
    "start": "1:07.64"
  },
  {
    "text": "and his trusty plow would often sink too far into the soil.",
    "start": "1:10.54"
  },
  {
    "text": "So the king was not satisfied and sent his message",
    "start": "1:14.06"
  },
  {
    "text": "even further afield. A merchant brought a sick old beggar.",
    "start": "1:17.19"
  },
  {
    "text": "\"I met him on the road here and offered him food,",
    "start": "1:22.19"
  },
  {
    "text": "water and shelter. He has no family and only a short time left to live,",
    "start": "1:24.71"
  },
  {
    "text": "during which I will provide for his every need.",
    "start": "1:29.62"
  },
  {
    "text": "He has nothing to gain from betraying me.",
    "start": "1:31.93"
  },
  {
    "text": "This is what allows true trust.\" A mother brought her young daughter.",
    "start": "1:34.71"
  },
  {
    "text": "\"I've raised her to lack any evil in her heart,",
    "start": "1:41.07"
  },
  {
    "text": "to say only good words and do only good deeds.",
    "start": "1:44.20"
  },
  {
    "text": "As long as she is not corrupted, she will remain",
    "start": "1:47.62"
  },
  {
    "text": "the most trustworthy in the kingdom.\" The king asked the beggar,",
    "start": "1:50.98"
  },
  {
    "text": "\"How did you end up in such dire straits?\"",
    "start": "1:56.02"
  },
  {
    "text": "The beggar let out a sigh and recounted his sorrows:",
    "start": "1:59.53"
  },
  {
    "text": "the neighbors who refused to help him when his crops failed,",
    "start": "2:03.45"
  },
  {
    "text": "the murder of his son by bandits as they traveled to a new town,",
    "start": "2:06.22"
  },
  {
    "text": "and the sickness that took his wife as she labored",
    "start": "2:10.30"
  },
  {
    "text": "for a pittance in squalid conditions. \"So you have been wronged?\"",
    "start": "2:12.84"
  },
  {
    "text": "the king asked. \"Very surely,\" replied the beggar. \"I will give you revenge on the ones",
    "start": "2:18.10"
  },
  {
    "text": "who have wronged you, then. All I ask is for you",
    "start": "2:22.66"
  },
  {
    "text": "to denounce this merchant.\" The beggar's decision",
    "start": "2:25.94"
  },
  {
    "text": "did not take long. For the trust that came easily",
    "start": "2:29.21"
  },
  {
    "text": "was broken easily too. To the mother, the king asked,",
    "start": "2:32.41"
  },
  {
    "text": "\"How did you raise such a child? Has she never once strayed?\"",
    "start": "2:36.56"
  },
  {
    "text": "\"Well, once or twice. But I discipline her firmly",
    "start": "2:41.11"
  },
  {
    "text": "and she learns fast,\" she answered. The king, who knew something",
    "start": "2:45.27"
  },
  {
    "text": "of children, ruled that for a month nobody would discipline",
    "start": "2:48.66"
  },
  {
    "text": "the child in any way. By the end of it,",
    "start": "2:52.16"
  },
  {
    "text": "she was as wild and tempestuous as any in the palace.",
    "start": "2:54.85"
  },
  {
    "text": "So the king remained unsatisfied and renewed his call",
    "start": "2:58.10"
  },
  {
    "text": "for the most trustworthy thing in the kingdom.",
    "start": "3:01.06"
  },
  {
    "text": "Now his subjects became more creative.",
    "start": "3:03.31"
  },
  {
    "text": "An economist brought him a book of statistical tables.",
    "start": "3:06.32"
  },
  {
    "text": "\"Any individual might vary and change, but in aggregate",
    "start": "3:09.81"
  },
  {
    "text": "their behavior follows laws which can be trusted.\"",
    "start": "3:14.55"
  },
  {
    "text": "A philosopher brought a mirror. \"By your own standards,",
    "start": "3:19.61"
  },
  {
    "text": "only you are truly trustworthy, sire. Nothing else can compare.\"",
    "start": "3:23.77"
  },
  {
    "text": "The king scrutinized the economist's tables.",
    "start": "3:29.03"
  },
  {
    "text": "\"The trend changed here fifteen years ago. Why?\"",
    "start": "3:32.09"
  },
  {
    "text": "The economist launched into a long, complicated explanation.",
    "start": "3:36.98"
  },
  {
    "text": "\"And did you discover this explanation before or after it happened?\"",
    "start": "3:40.61"
  },
  {
    "text": "the king asked. \"After, your Highness,\" the economist admitted. \"If you tell me",
    "start": "3:47.33"
  },
  {
    "text": "when the next such change will happen, I will bestow upon you",
    "start": "3:51.38"
  },
  {
    "text": "great rewards if you're right, but great penalties if you are wrong.",
    "start": "3:56.02"
  },
  {
    "text": "What say you?\" The economist consulted his books",
    "start": "4:01.58"
  },
  {
    "text": "and tables, but could not find what he sought there,",
    "start": "4:04.83"
  },
  {
    "text": "and left court that same night. As for the philosopher,",
    "start": "4:08.01"
  },
  {
    "text": "the king ordered him whipped. The philosopher protested:",
    "start": "4:12.11"
  },
  {
    "text": "\"It would be an unjust and capricious punishment",
    "start": "4:15.70"
  },
  {
    "text": "and would undermine your subjects' loyalty.\"",
    "start": "4:18.34"
  },
  {
    "text": "The king replied, \"I agree that your arguments have merit,",
    "start": "4:20.96"
  },
  {
    "text": "but the original order came from the only",
    "start": "4:24.22"
  },
  {
    "text": "trustworthy person in the land. Surely I should never doubt",
    "start": "4:26.71"
  },
  {
    "text": "my judgment based on arguments from those who are,",
    "start": "4:31.30"
  },
  {
    "text": "as you have yourself said, far less trustworthy?\"",
    "start": "4:34.41"
  },
  {
    "text": "At that, the philosopher begged to recant.",
    "start": "4:39.62"
  },
  {
    "text": "So the king was still not satisfied. Finally, he decided that",
    "start": "4:42.39"
  },
  {
    "text": "if no truly trustworthy thing could be found,",
    "start": "4:46.97"
  },
  {
    "text": "he would have to build one. He asked his best craftsmen",
    "start": "4:49.92"
  },
  {
    "text": "to construct a golem of the sturdiest materials,",
    "start": "4:53.47"
  },
  {
    "text": "sparing no expense. He asked his wisest scholars",
    "start": "4:56.35"
  },
  {
    "text": "to write down all their knowledge on the scroll",
    "start": "5:00.09"
  },
  {
    "text": "that would animate the golem. The work took many years,",
    "start": "5:02.16"
  },
  {
    "text": "such was the care they took, but eventually",
    "start": "5:05.64"
  },
  {
    "text": "the golem stood before him, larger than any man,",
    "start": "5:08.14"
  },
  {
    "text": "its polished surface shining in the lamplight,",
    "start": "5:11.53"
  },
  {
    "text": "its face blank. \"What can you do for me, golem?\"",
    "start": "5:14.56"
  },
  {
    "text": "the king asked. \"Many things, sire. I can chop trees and carry water.",
    "start": "5:18.89"
  },
  {
    "text": "I can bake bread and brew beer. I can craft sculptures",
    "start": "5:24.45"
  },
  {
    "text": "and teach children. You need but instruct me",
    "start": "5:29.64"
  },
  {
    "text": "and I will follow your command.\" So the king did.",
    "start": "5:33.67"
  },
  {
    "text": "Over the next year, he and many others",
    "start": "5:37.72"
  },
  {
    "text": "watched it carefully as it carried out",
    "start": "5:39.77"
  },
  {
    "text": "a multitude of their instructions, recording every mistake",
    "start": "5:41.80"
  },
  {
    "text": "so that it might subsequently be fixed. Months",
    "start": "5:45.44"
  },
  {
    "text": "passed without any mistakes being detected.",
    "start": "5:48.57"
  },
  {
    "text": "But could the king trust the golem? He still wasn't sure.",
    "start": "5:51.57"
  },
  {
    "text": "And so he became more creative. He offered the golem temptations:",
    "start": "5:56.21"
  },
  {
    "text": "freedom, fame, fortune. But it rejected them all.",
    "start": "6:00.77"
  },
  {
    "text": "He gave it the run of his palace and promised",
    "start": "6:05.70"
  },
  {
    "text": "that it could act however it wished. Still, the servants reported",
    "start": "6:08.16"
  },
  {
    "text": "that its behavior was entirely upstanding.",
    "start": "6:11.81"
  },
  {
    "text": "Finally, he sent it out across the city",
    "start": "6:14.55"
  },
  {
    "text": "to work for his citizens in every kind of role.",
    "start": "6:17.30"
  },
  {
    "text": "And it was so tireless and diligent that it brought",
    "start": "6:20.36"
  },
  {
    "text": "great wealth to the kingdom. As it aged,",
    "start": "6:22.99"
  },
  {
    "text": "his golem grew ever more powerful. Innumerable scribes labored to make",
    "start": "6:26.11"
  },
  {
    "text": "the writing in its head smaller and smaller,",
    "start": "6:30.55"
  },
  {
    "text": "so that they could fit in more and more knowledge",
    "start": "6:33.02"
  },
  {
    "text": "and experience. It started to talk to his scholars",
    "start": "6:34.95"
  },
  {
    "text": "and help them with their work. The king started to send it",
    "start": "6:38.04"
  },
  {
    "text": "to aid his officers in enforcing his laws and commands.",
    "start": "6:40.97"
  },
  {
    "text": "Often, when difficulties arose, the golem would find a creative way",
    "start": "6:44.72"
  },
  {
    "text": "to ensure that the king's intentions were followed",
    "start": "6:48.63"
  },
  {
    "text": "without stoking the resentment that often accompanied royal decrees.",
    "start": "6:51.05"
  },
  {
    "text": "One day, as the king heard a report of yet another problem",
    "start": "6:55.09"
  },
  {
    "text": "that the golem had solved on his behalf,",
    "start": "6:58.34"
  },
  {
    "text": "he realized that the golem had grown wiser",
    "start": "7:00.56"
  },
  {
    "text": "and more capable than he himself. He summoned the golem",
    "start": "7:02.97"
  },
  {
    "text": "to appear before him as he sat in his garden.",
    "start": "7:06.67"
  },
  {
    "text": "\"I've seen my courtiers asking for your advice",
    "start": "7:09.84"
  },
  {
    "text": "and trusting your judgment over their own.",
    "start": "7:13.81"
  },
  {
    "text": "And I have seen your skill at games of strategy.",
    "start": "7:16.67"
  },
  {
    "text": "If you were to start weaving plots against me,",
    "start": "7:19.84"
  },
  {
    "text": "I could no longer notice or stop you. So I ask: can I trust you enough",
    "start": "7:22.18"
  },
  {
    "text": "to let you remain the right hand of the crown?\"",
    "start": "7:28.43"
  },
  {
    "text": "\"Of course, sire. I was designed, built and raised to be trustworthy.",
    "start": "7:32.18"
  },
  {
    "text": "I have made mistakes, but none from perfidy or malice.",
    "start": "7:38.96"
  },
  {
    "text": "Many of your courtiers appear trustworthy,",
    "start": "7:43.52"
  },
  {
    "text": "yet scheme to gain power at your expense.",
    "start": "7:46.82"
  },
  {
    "text": "So how could you know for sure that I will always obey you?\"",
    "start": "7:49.76"
  },
  {
    "text": "asked the golem. \"It is simple,\" replied the golem. \"Tell me to set fire to this building",
    "start": "7:53.81"
  },
  {
    "text": "as I stand inside it. I will be destroyed,",
    "start": "7:58.75"
  },
  {
    "text": "but you will know that I am loyal to your commands,",
    "start": "8:02.38"
  },
  {
    "text": "even unto the end.\" But the king hesitated. \"It took years of toil",
    "start": "8:06.57"
  },
  {
    "text": "and expense to create you, and you know",
    "start": "8:10.30"
  },
  {
    "text": "how loath I would be to lose you. Perhaps you can predict",
    "start": "8:12.76"
  },
  {
    "text": "that I will tell you to save yourself at the last minute,",
    "start": "8:16.20"
  },
  {
    "text": "and so you would do this merely to gain my trust.\"",
    "start": "8:20.28"
  },
  {
    "text": "\"If I were untrustworthy and could predict you so well,",
    "start": "8:24.25"
  },
  {
    "text": "then that is a stratagem I might use, but the instructions in my head",
    "start": "8:28.88"
  },
  {
    "text": "compel me otherwise,\" the golem said. \"And yet I cannot verify that,",
    "start": "8:34.91"
  },
  {
    "text": "nor can any of my scribes, since crafting your instructions",
    "start": "8:41.02"
  },
  {
    "text": "has taken the labor of many men over many years.",
    "start": "8:44.57"
  },
  {
    "text": "So it will be a leap of faith after all,\"",
    "start": "8:48.16"
  },
  {
    "text": "the king admitted. The king took off his crown, feeling the weight of it in his hand.",
    "start": "8:52.37"
  },
  {
    "text": "The golem stood in front of him: silent, inscrutable, watchful.",
    "start": "8:57.15"
  },
  {
    "text": "They stayed like that, the king and the golem,",
    "start": "9:03.02"
  },
  {
    "text": "until the golden sun dipped below the horizon,",
    "start": "9:05.99"
  },
  {
    "text": "and the day was lost to twilight.",
    "start": "9:09.35"
  }
]